Revit 2027 API
ParameterTypeId.PointAdaptiveTypeParam Property
 "Point"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointAdaptiveTypeParam { get; }
Public Shared ReadOnly Property PointAdaptiveTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointAdaptiveTypeParam {
	ForgeTypeId^ get ();
}
static member PointAdaptiveTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace